app/controllers/list_favorites_controller.rb

SELECT "list_favorites".* FROM "list_favorites"
---
  def index
    @list_favorites = ListFavorite.all