app/controllers/lists_controller.rb

  def index
    @lists = List.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "lists".* FROM "lists" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "lists"

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at", "is_public", "id_user") VALUES (?, ?, ?, ?, ?)  [["name", "list5"], ["created_at", "2017-06-07 22:18:30.731491"], ["updated_at", "2017-06-07 22:18:30.731491"], ["is_public", 1], ["id_user", 10]]

  def destroy
    @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]