app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks"
---
  def index
    @tasks = Task.all.paginate(:page => params[:page], :per_page => 5)